"""
Дана строка текста (или введённая через консоль). Программа должна вернуть словарь с четырьмя ключами:
"гласные",
"согласные",
"цифры",
"пунктуация".
Значения — количество символов каждого типа в строке.
"""

inp_string = input("Input russian string: ")
string = inp_string.lower()
result = {"гласные": 0, "согласные": 0, "цифры": 0, "пунктуация": 0}

glasnie = ["а", "у", "о", "и", "э", "ы", "я", "ю", "е", "ё"]
soglasnie = ["б", "в", "г", "д", "ж", "з", "й", "к", "л", "м", "н", "п", "р", "с", "т", "ф", "х", "ц", "ч", "ш", "щ"]
cifri = ["0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]


for symbol in string: #прохожу по каждому символу в строке
    if symbol in glasnie: #проверка на TRUE наличия символа в словаре
        result["гласные"] = result.get("гласные") + 1 #достаю значение для ключа и итерирую его
    elif symbol in soglasnie:
        result["согласные"] = result.get("согласные") + 1
    elif symbol in cifri:
        result["цифры"] = result.get("цифры") + 1
    else:
       result["пунктуация"] = result.get("пунктуация") + 1

print(f"{inp_string} -> {result}")
